export const data = [
  {
    id: 1,
    src: "https://gas-kvas.com/grafic/uploads/posts/2023-10/1696498092_gas-kvas-com-p-kartinki-pushkin-50.jpg",
    name: "А.С.Пушкин",
    books: [
      {
        id: 1,
        bookid: 1,
        avtor: "А.С.Пушкин",
        src: "https://gas-kvas.com/grafic/uploads/posts/2023-10/1696498092_gas-kvas-com-p-kartinki-pushkin-50.jpg",
        name: "Капитанская дочка",
        date: 1836,
        tom: 4,
        syujet:
          "На склоне лет помещик Пётр Андреевич Гринёв ведёт повествование о бурных событиях своей молодости. Детство своё он провёл в родительском поместье в Симбирской губернии, пока в 17 лет строгий отец, офицер в отставке, не распорядился отправить его служить в армию: «Полно ему бегать по девичьим да лазить на голубятни».Волею судьбы по пути к месту службы молодой офицер встречается с Емельяном Пугачёвым, который тогда был просто беглым, никому не известным казаком. Во время бурана[K 2] тот соглашается проводить Гринёва с его старым слугой Савельичем к постоялому двору. В знак признательности за услугу Пётр отдаёт ему свой заячий тулуп.Приехав на службу в пограничную Белогорскую крепость, Пётр влюбляется в дочь коменданта крепости, Машу Миронову. Сослуживец Гринёва, офицер Алексей Швабрин, с которым он познакомился уже в крепости, тоже оказывается неравнодушен к капитанской дочери и вызывает Петра на дуэль, в ходе которой наносит Гринёву ранение. О поединке становится известно отцу Петра, который отказывается благословить брак с бесприданницей.Тем временем разгорается пугачёвщина, которую Гринёв охарактеризовал как «русский бунт, бессмысленный и беспощадный». Пугачёв со своим войском наступает и захватывает крепости в оренбургской степи; дворян казнит, а казаков призывает в своё войско. Родители Маши погибают от рук бунтовщиков; Швабрин, испугавшись казни, присягает Пугачёву, а Гринёв от этого отказывается: «Нет, я природный дворянин. Я присягал государыне императрице. Тебе служить не могу», — говорит он Пугачёву. От верной казни его спасает Савельич, обратившись к Пугачёву. Тот узнаёт человека, который ему помог зимой, и дарит ему жизнь. Гринёв уезжает в осаждённый повстанцами Оренбург и воюет против Пугачёва, но однажды получает письмо от Маши, которая осталась в Белогорской крепости из-за болезни. Из письма он узнаёт, что Швабрин хочет насильно взять её в жёны. Гринёв без разрешения покидает службу, прибывает в Белогорскую крепость и благодаря помощи Пугачёва спасает Машу. Позже, по доносу Швабрина, Гринева арестовывают уже правительственные войска. Гринёва приговаривают к смертной казни, заменённой на ссылку в Сибирь на вечное поселение. После этого Маша едет в Царское Село к Екатерине II и вымаливает прощение жениху. Перед приёмом у Екатерины она встречает в парке женщину и, разговорившись, рассказывает ей всю свою историю, замечая, что Гринёв не смог оправдаться перед судом только потому, что не хотел впутывать её. Эта женщина — не узнанная Машей императрица. Убедившись в невиновности Гринёва, она дает ему прощение.",
      },
    ],
  },
  {
    id: 2,
    src: "https://i.pinimg.com/736x/4d/66/5f/4d665f87dd9137b62b2d7aa552fc1379.jpg",
    name: "Н.В.Гоголь",
    books: [
      {
        id: 1,
        bookid: 2,
        avtor: "Н.В.Гоголь",
        src: "https://i.pinimg.com/736x/4d/66/5f/4d665f87dd9137b62b2d7aa552fc1379.jpg",
        name: "Шинель",
        date: 1843,
        tom: 1,
        syujet:
          "В намеренно косноязычной сказовой манере, перебиваемой патетическими монологами, автор повествует о жизни так называемого «маленького человека».Главный герой повести — Акакий Акакиевич Башмачкин, бедный титулярный советник из Петербурга. Он ревностно выполнял свои обязанности, очень любил ручное переписывание бумаг, но в общем роль его в департаменте была крайне незначительна, из-за чего над ним нередко подшучивали молодые чиновники. Жалование его составляло 400 рублей в год.С полным каламбуров зачином повести контрастирует знаменитое «гуманное место», когда за «проникающими словами» Акакия Акакиевича: «Оставьте меня, зачем вы меня обижаете?» — слышатся другие слова: «Я брат твой».Однажды Акакий Акакиевич заметил, что его старенькая шинель совсем пришла в негодность. Он отнёс её к портному Петровичу, чтобы тот залатал её, однако последний отказался чинить шинель, сказав, что надо шить новую.Акакий Акакиевич уменьшил расходы: по вечерам прекратил пить чай, старался ходить на цыпочках, чтобы не истёрлись ботинки, реже отдавал прачке бельё в стирку, а дома, чтобы не изнашивать одежду, носил только халат.Когда премия к празднику оказалась больше ожидаемого, титулярный советник вместе с портным отправился покупать материал для новой шинели.И вот однажды морозным утром Акакий Акакиевич вошёл в департамент в новой шинели. Все принялись хвалить и поздравлять его, а вечером его пригласили на именины к помощнику столоначальника. Акакий Акакиевич был в прекрасном расположении духа. Ближе к полуночи он возвращался домой, когда к нему вдруг со словами «А шинель-то моя!» подошли какие-то люди с усами и сняли шинель с плеч.",
      },
    ],
  },
  {
    id: 3,
    src: "https://avatars.mds.yandex.net/i?id=f3afb17283b6cc66f8467569e8264317_l-5083805-images-thumbs&ref=rim&n=13&w=1080&h=1350",
    name: "Л.Н.Толстой",
    books: [
      {
        id: 1,
        bookid: 3,
        avtor: "Л.Н.Толстой",
        src: "https://avatars.mds.yandex.net/i?id=f3afb17283b6cc66f8467569e8264317_l-5083805-images-thumbs&ref=rim&n=13&w=1080&h=1350",
        name: "Война и мир",
        date: " 1805—1812",
        tom: "1805—1812",
        syujet:
          "В романе обилие глав и частей, большинство из которых имеет сюжетную законченность. Короткие главы и множество частей позволяют Толстому перемещать повествование во времени и пространстве и благодаря этому уместить в одном романе сотни эпизодов.",
      },
    ],
  },
];
